IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_I2C0_CFG.xml
	<register id="CFG_I2C_IRQENABLE_CLR" acronym="CFG_I2C_IRQENABLE_CLR" offset="0x30" width="32" description="Per-event interrupt clear bit vector.">
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Write 0s for future compatibility Read returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="XDR_IE" width="1" begin="14" end="14" resetval="0x0" description="Transmit Draining interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[XDR]" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR_IE" width="1" begin="13" end="13" resetval="0x0" description="Receive Draining interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[RDR]" range="13" rwaccess="R/W"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun enable clear" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow enable clear" range="10" rwaccess="R/W"/> 
		<bitfield id="ASS_IE" width="1" begin="9" end="9" resetval="0x0" description="Addressed as Slave interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[AAS]" range="9" rwaccess="R/W"/> 
		<bitfield id="BF_IE" width="1" begin="8" end="8" resetval="0x0" description="Bus Free interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[BF]" range="8" rwaccess="R/W"/> 
		<bitfield id="AERR_IE" width="1" begin="7" end="7" resetval="0x0" description="Access Error interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[AERR]" range="7" rwaccess="R/W"/> 
		<bitfield id="STC_IE" width="1" begin="6" end="6" resetval="0x0" description="Start Condition interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[STC]" range="6" rwaccess="R/W"/> 
		<bitfield id="GC_IE" width="1" begin="5" end="5" resetval="0x0" description="General call Interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[GC]" range="5" rwaccess="R/W"/> 
		<bitfield id="XRDY_IE" width="1" begin="4" end="4" resetval="0x0" description="Transmit data ready interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[XRDY]" range="4" rwaccess="R/W"/> 
		<bitfield id="RRDY_IE" width="1" begin="3" end="3" resetval="0x0" description="Receive data ready interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[RRDY]" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY_IE" width="1" begin="2" end="2" resetval="0x0" description="Register access ready interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[ARDY]" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK_IE" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgement interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[NACK]" range="1" rwaccess="R/W"/> 
		<bitfield id="AL_IE" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost interrupt enable clear Mask or unmask the interrupt signaled by bit in I2C_STAT[AL]" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_WE" acronym="CFG_I2C_WE" offset="0x34" width="32" description="I2C wakeup enable vector (legacy).">
		<bitfield id="XDR" width="1" begin="14" end="14" resetval="0x0" description="Transmit Draining wakeup set" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR" width="1" begin="13" end="13" resetval="0x0" description="Receive Draining wakeup set" range="13" rwaccess="R/W"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun wakeup set" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow wakeup set" range="10" rwaccess="R/W"/> 
		<bitfield id="AAS" width="1" begin="9" end="9" resetval="0x0" description="Address as slave IRQ wakeup set" range="9" rwaccess="R/W"/> 
		<bitfield id="BF" width="1" begin="8" end="8" resetval="0x0" description="Bus Free IRQ wakeup set" range="8" rwaccess="R/W"/> 
		<bitfield id="STC" width="1" begin="6" end="6" resetval="0x0" description="Start Condition IRQ wakeup set" range="6" rwaccess="R/W"/> 
		<bitfield id="GC" width="1" begin="5" end="5" resetval="0x0" description="General call IRQ wakeup set" range="5" rwaccess="R/W"/> 
		<bitfield id="DRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive/Transmit data ready IRQ wakeup set" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register access ready IRQ wakeup set" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgment IRQ wakeup set" range="1" rwaccess="R/W"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost IRQ wakeup set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_DMARXENABLE_SET" acronym="CFG_I2C_DMARXENABLE_SET" offset="0x38" width="32" description="Per-event DMA RX enable set.">
		<bitfield id="DMARX_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Receive DMA channel enable set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_DMATXENABLE_SET" acronym="CFG_I2C_DMATXENABLE_SET" offset="0x3C" width="32" description="Per-event DMA TX enable set.">
		<bitfield id="DMATX_ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Transmit DMA channel enable set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_DMARXENABLE_CLR" acronym="CFG_I2C_DMARXENABLE_CLR" offset="0x40" width="32" description="Per-event DMA RX enable clear.">
		<bitfield id="DMARX_ENABLE_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="Receive DMA channel enable clear" range="0" rwaccess="R/W1C"/>
	</register>
	<register id="CFG_I2C_DMATXENABLE_CLR" acronym="CFG_I2C_DMATXENABLE_CLR" offset="0x44" width="32" description="Per-event DMA TX enable clear.">
		<bitfield id="DMATX_ENABLE_CLEAR" width="1" begin="0" end="0" resetval="0x0" description="Transmit DMA channel enable clear" range="0" rwaccess="R/W1C"/>
	</register>
	<register id="CFG_I2C_DMARXWAKE_EN" acronym="CFG_I2C_DMARXWAKE_EN" offset="0x48" width="32" description="Per-event DMA RX wakeup enable.">
		<bitfield id="XDR" width="1" begin="14" end="14" resetval="0x0" description="Transmit Draining wakeup set" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR" width="1" begin="13" end="13" resetval="0x0" description="Receive Draining wakeup set" range="13" rwaccess="R/W"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun wakeup set" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow wakeup set" range="10" rwaccess="R/W"/> 
		<bitfield id="AAS" width="1" begin="9" end="9" resetval="0x0" description="Address as slave IRQ wakeup set" range="9" rwaccess="R/W"/> 
		<bitfield id="BF" width="1" begin="8" end="8" resetval="0x0" description="Bus Free IRQ wakeup set" range="8" rwaccess="R/W"/> 
		<bitfield id="STC" width="1" begin="6" end="6" resetval="0x0" description="Start Condition IRQ wakeup set" range="6" rwaccess="R/W"/> 
		<bitfield id="GC" width="1" begin="5" end="5" resetval="0x0" description="General call IRQ wakeup set" range="5" rwaccess="R/W"/> 
		<bitfield id="DRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive/Transmit data ready IRQ wakeup set" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register access ready IRQ wakeup set" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgment IRQ wakeup set" range="1" rwaccess="R/W"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost IRQ wakeup set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_DMATXWAKE_EN" acronym="CFG_I2C_DMATXWAKE_EN" offset="0x4C" width="32" description="Per-event DMA TX wakeup enable.">
		<bitfield id="XDR" width="1" begin="14" end="14" resetval="0x0" description="Transmit Draining wakeup set" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR" width="1" begin="13" end="13" resetval="0x0" description="Receive Draining wakeup set" range="13" rwaccess="R/W"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun wakeup set" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow wakeup set" range="10" rwaccess="R/W"/> 
		<bitfield id="AAS" width="1" begin="9" end="9" resetval="0x0" description="Address as slave IRQ wakeup set" range="9" rwaccess="R/W"/> 
		<bitfield id="BF" width="1" begin="8" end="8" resetval="0x0" description="Bus Free IRQ wakeup set" range="8" rwaccess="R/W"/> 
		<bitfield id="STC" width="1" begin="6" end="6" resetval="0x0" description="Start Condition IRQ wakeup set" range="6" rwaccess="R/W"/> 
		<bitfield id="GC" width="1" begin="5" end="5" resetval="0x0" description="General call IRQ wakeup set" range="5" rwaccess="R/W"/> 
		<bitfield id="DRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive/Transmit data ready IRQ wakeup set" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register access ready IRQ wakeup set" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgment IRQ wakeup set" range="1" rwaccess="R/W"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost IRQ wakeup set" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_IE" acronym="CFG_I2C_IE" offset="0x84" width="32" description="I2C interrupt enable vector (legacy).">
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Write 0s for future compatibility Read returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="XDR_IE" width="1" begin="14" end="14" resetval="0x0" description="Transmit Draining interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[XDR]" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR_IE" width="1" begin="13" end="13" resetval="0x0" description="Receive Draining interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[RDR]" range="13" rwaccess="R/W"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun enable set" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow enable set" range="10" rwaccess="R/W"/> 
		<bitfield id="ASS_IE" width="1" begin="9" end="9" resetval="0x0" description="Addressed as Slave interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[AAS]" range="9" rwaccess="R/W"/> 
		<bitfield id="BF_IE" width="1" begin="8" end="8" resetval="0x0" description="Bus Free interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[BF]" range="8" rwaccess="R/W"/> 
		<bitfield id="AERR_IE" width="1" begin="7" end="7" resetval="0x0" description="Access Error interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[AERR]" range="7" rwaccess="R/W"/> 
		<bitfield id="STC_IE" width="1" begin="6" end="6" resetval="0x0" description="Start Condition interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[STC]" range="6" rwaccess="R/W"/> 
		<bitfield id="GC_IE" width="1" begin="5" end="5" resetval="0x0" description="General call Interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[GC]" range="5" rwaccess="R/W"/> 
		<bitfield id="XRDY_IE" width="1" begin="4" end="4" resetval="0x0" description="Transmit data ready interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[XRDY]" range="4" rwaccess="R/W"/> 
		<bitfield id="RRDY_IE" width="1" begin="3" end="3" resetval="0x0" description="Receive data ready interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[RRDY]" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY_IE" width="1" begin="2" end="2" resetval="0x0" description="Register access ready interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[ARDY]" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK_IE" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgement interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[NACK]" range="1" rwaccess="R/W"/> 
		<bitfield id="AL_IE" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost interrupt enable Mask or unmask the interrupt signaled by bit in I2C_STAT[AL]" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_STAT" acronym="CFG_I2C_STAT" offset="0x88" width="32" description="I2C interrupt status vector (legacy).">
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Write 0s for future compatibility Read returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="XDR" width="1" begin="14" end="14" resetval="0x0" description="Transmit draining IRQ status" range="14" rwaccess="R/W"/> 
		<bitfield id="RDR" width="1" begin="13" end="13" resetval="0x0" description="Receive draining IRQ status" range="13" rwaccess="R/W"/> 
		<bitfield id="BB" width="1" begin="12" end="12" resetval="0x0" description="Bus busy statusWriting into this bit has no effect" range="12" rwaccess="R"/> 
		<bitfield id="ROVR" width="1" begin="11" end="11" resetval="0x0" description="Receive overrun statusWriting into this bit has no effect" range="11" rwaccess="R/W"/> 
		<bitfield id="XUDF" width="1" begin="10" end="10" resetval="0x0" description="Transmit underflow statusWriting into this bit has no effect" range="10" rwaccess="R/W"/> 
		<bitfield id="AAS" width="1" begin="9" end="9" resetval="0x0" description="Address recognized as slave IRQ status" range="9" rwaccess="R/W"/> 
		<bitfield id="BF" width="1" begin="8" end="8" resetval="0x0" description="Bus Free IRQ status" range="8" rwaccess="R/W"/> 
		<bitfield id="AERR" width="1" begin="7" end="7" resetval="0x0" description="Access Error IRQ status" range="7" rwaccess="R/W"/> 
		<bitfield id="STC" width="1" begin="6" end="6" resetval="0x0" description="Start Condition IRQ status" range="6" rwaccess="R/W"/> 
		<bitfield id="GC" width="1" begin="5" end="5" resetval="0x0" description="General call IRQ status Set to '1' by core when General call address detected and interrupt signaled to MPUSS Write '1' to clear" range="5" rwaccess="R/W"/> 
		<bitfield id="XRDY" width="1" begin="4" end="4" resetval="0x0" description="Transmit data ready IRQ status Set to '1' by core when transmitter and when new data is requested When set to '1' by core, an interrupt is signaled to MPUSS Write '1' to clear" range="4" rwaccess="R/W"/> 
		<bitfield id="RRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive data ready IRQ status Set to '1' by core when receiver mode, a new data is able to be read When set to '1' by core, an interrupt is signaled to MPUSS Write '1' to clear" range="3" rwaccess="R/W"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register access ready IRQ status When set to '1' it indicates that previous access has been performed and registers are ready to be accessed again An interrupt is signaled to MPUSS Write '1' to clear" range="2" rwaccess="R/W"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No acknowledgement IRQ status Bit is set when No Acknowledge has been received, an interrupt is signaled to MPUSS Write '1' to clear this bit" range="1" rwaccess="R/W"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration lost IRQ status This bit is automatically set by the hardware when it loses the Arbitration in master transmit mode, an interrupt is signaled to MPUSS During reads, it always returns 0" range="0" rwaccess="R/W"/>
	</register>
