IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/MCU_I2C0_CFG.xml
	<register id="CFG_I2C_OA3" acronym="CFG_I2C_OA3" offset="0xCC" width="32" description="I2C Own Address 3 Register">
		<bitfield id="OA3" width="10" begin="9" end="0" resetval="0x0" description="Own address 3" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_I2C_ACTOA" acronym="CFG_I2C_ACTOA" offset="0xD0" width="32" description="I2C Active Own Address Register.">
		<bitfield id="OA3_ACT" width="1" begin="3" end="3" resetval="0x0" description="Own Address 3 active" range="3" rwaccess="R"/> 
		<bitfield id="OA2_ACT" width="1" begin="2" end="2" resetval="0x0" description="Own Address 2 active" range="2" rwaccess="R"/> 
		<bitfield id="OA1_ACT" width="1" begin="1" end="1" resetval="0x0" description="Own Address 1 active" range="1" rwaccess="R"/> 
		<bitfield id="OA0_ACT" width="1" begin="0" end="0" resetval="0x0" description="Own Address 0 active" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_I2C_SBLOCK" acronym="CFG_I2C_SBLOCK" offset="0xD4" width="32" description="I2C Clock Blocking Enable Register.">
		<bitfield id="OA3_EN" width="1" begin="3" end="3" resetval="0x0" description="Enable I2C Clock Blocking for Own Address 3" range="3" rwaccess="R/W"/> 
		<bitfield id="OA2_EN" width="1" begin="2" end="2" resetval="0x0" description="Enable I2C Clock Blocking for Own Address 2" range="2" rwaccess="R/W"/> 
		<bitfield id="OA1_EN" width="1" begin="1" end="1" resetval="0x0" description="Enable I2C Clock Blocking for Own Address 1" range="1" rwaccess="R/W"/> 
		<bitfield id="OA0_EN" width="1" begin="0" end="0" resetval="0x0" description="Enable I2C Clock Blocking for Own Address 0" range="0" rwaccess="R/W"/>
	</register>
</module>